app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "created_at", "updated_at", "name", "body") VALUES (?, ?, ?, ?, ?)  [["user_id", 12], ["created_at", 2017-07-09 09:40:05 UTC], ["updated_at", 2017-07-09 09:40:05 UTC], ["name", "HARRY"], ["body", "Potter content"]]
---
  def create
   @user = current_user
   @post = @user.posts.new(post_params)
   if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 34]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
  def destroy
    Post.find(params[:id]).destroy